app/Controllers/Auth.php

SELECT *
FROM `pengguna`
WHERE `username` = 'admin'
AND `password` = 'admin'
 LIMIT 1
---
    public function doLogin() {
        $model = new PenggunaModel();
        $user = $model->where('username', $this->request->getPost('username'))
                      ->where('password', $this->request->getPost('password'))
                      ->first();