app/Controllers/Home.php

SELECT *
FROM `produk`
---
    public function index() {
        $this->cekLogin();
        $produkModel = new ProdukModel();
        $data['produk'] = $produkModel->findAll();