app/Controllers/Keranjang.php

SELECT *
FROM `pengguna`
WHERE `pengguna`.`id_pengguna` = '3'
SELECT *
FROM `produk`
WHERE `id_produk` IN (1)
---
    public function checkout()
    {
        $keranjang = session()->get('keranjang') ?? [];
        if (empty($keranjang)) return redirect()->to('/');

        $penggunaModel = new PenggunaModel();
        $produkModel = new ProdukModel();

        $data['pengguna'] = $penggunaModel->find(session()->get('id_pengguna'));

        $ids_produk = array_keys($keranjang);
        $produk_di_keranjang = $produkModel->whereIn('id_produk', $ids_produk)->findAll();

SELECT *
FROM `produk`
WHERE `id_produk` IN (1)
INSERT INTO `transaksi` (`id_pengguna`, `alamat_pengiriman`, `opsi_pengiriman`, `biaya_pengiriman`, `metode_pembayaran`, `total_harga_semua`, `status_pembayaran`) VALUES ('3', '', 'Hemat Kargo', 34000, 'Transfer Bank - BRI', 184000, 'Belum Dibayar')
---
    public function prosesPesanan()
    {
        $keranjang = session()->get('keranjang') ?? [];
        if (empty($keranjang)) return redirect()->to('/');

        $postData = $this->request->getPost();

        $db = \Config\Database::connect();
        $db->transStart();

        $transaksiModel = new TransaksiModel();
        $produkModel = new ProdukModel();

        $subtotal_produk = 0;
        $ids_produk = array_keys($keranjang);
        $produk_di_keranjang = $produkModel->whereIn('id_produk', $ids_produk)->findAll();
        foreach($produk_di_keranjang as $p) {
            $subtotal_produk += $p['harga'] * $keranjang[$p['id_produk']];
        }

        $biaya_pengiriman = (float) $postData['biaya_pengiriman'];
        $total_pembayaran = $subtotal_produk + $biaya_pengiriman;

        $id_transaksi = $transaksiModel->insert([
            'id_pengguna'         => session()->get('id_pengguna'),
            'alamat_pengiriman'   => $postData['alamat_pengiriman'],
            'opsi_pengiriman'     => $postData['opsi_pengiriman'],
            'biaya_pengiriman'    => $biaya_pengiriman,
            'metode_pembayaran'   => $postData['metode_pembayaran'],
            'total_harga_semua'   => $total_pembayaran,
            'status_pembayaran'   => 'Belum Dibayar',
        ], true);