app/Controllers/Transaksi.php

SELECT *
FROM `transaksi`
WHERE `id_pengguna` = '3'
---
    public function index() {
        $this->cekLogin();
        $id = session()->get('id_pengguna');
        $transaksiModel = new TransaksiModel();
        $data['transaksi'] = $transaksiModel->where('id_pengguna', $id)->findAll();